/*  COMPILE C PROGRAMS                            */
ADUCBAT: PGM   PARM(&LIB &FILE &SRCMBR &TESTP &DEBUG &LSTDBG )

  DCL &LIB     TYPE(*CHAR) LEN(10)
  DCL &FILE    TYPE(*CHAR) LEN(10)
  DCL &SRCMBR  TYPE(*CHAR) LEN(10)
  DCL &TESTP   TYPE(*CHAR) LEN(4)
  DCL &DEBUG   TYPE(*CHAR) LEN(6)
  DCL &LSTDBG  TYPE(*CHAR) LEN(7)
  DCL &QINCLUDE  TYPE(*CHAR) LEN(10)
  DCL &PGMLIB  TYPE(*CHAR) LEN(10)

  MONMSG CPF3C50
  MONMSG CPF2184
  MONMSG LNC9001 EXEC(GOTO DONE)


  CHGVAR &QINCLUDE ('ADU' *CAT &TESTP )
  CHGVAR &PGMLIB ('ADU' *CAT &TESTP *CAT 'LIB' )
  CHGLIBL LIBL(QGPL QTEMP &QINCLUDE ADUPRODLIB) CURLIB(&PGMLIB)

             CRTCMOD    MODULE(&PGMLIB/&SRCMBR) SRCFILE(&LIB/&FILE) +
                          SRCMBR(&SRCMBR) OUTPUT(*PRINT) +
                          OPTION(*SECLVL *NOLOGMSG) SYSIFCOPT(*ALL) +
                          CHECKOUT(*USAGE) OPTIMIZE(*NONE) +
                          DBGVIEW(*LIST) DEFINE(AS400) FLAG(10) +
                          LANGLVL(*ANSI) REPLACE(*YES) TGTRLS(V4R3M0)
             MONMSG     MSGID(CZM0613)

DONE:

ENDPGM
